[
    {
        "_id": 1,
        "order": 0,
        "title": "Stitch Sense",
        "image": "stitch-sense.jpg",
        "description": "Official web site of the Stitch Sense clothing manufacturer",
        "myRole": "Sole designer and developer from conceptualization to execution. The site is written in React (with TypeScript) and its purpose is to advertise the services and porfolio of the company. It was an enjoyable project to work on with a lot of creative freedom and a great client to collaborate with.",
        "technologies": ["React", "TypeScript", "CSS", "Material UI"],
        "month": "February",
        "year": 2024,
        "url": "https://www.stitch-sense.com/",
        "type": "SPA",
        "category": "real",
        "notes": [{ "note": "Loading time may be slow due to the web app being deployed on a free tier on Render.com" }]
    },
    {
        "_id": 2,
        "order": 1,
        "title": "IvyLu - Art & Beauty",
        "image": "ivylu.jpg",
        "description": "Official web app of the IvyLu beauty salon",
        "myRole": "Sole designer and developer from conceptualization to execution. The web app allows for users to register, order products, and schedule their beauty salon services online. The unique concept of the business is that, amongst other things, it gives rising artists the opportunity to display their work in the premises of establishment and boost their popularity.",
        "technologies": ["React", "TypeScript", "CSS", "Material UI", "Node.js", "Express", "MongoDB"],
        "month": "January",
        "year": 2023,
        "url": "http://ivylu.arielbehar.com/",
        "type": "SPA",
        "category": "real",
        "notes": [{ "note": "The site is currently under development" }]
    },
    {
        "_id": 3,
        "order": 2,
        "title": "Brasileirão 2019",
        "image": "brasileirao.jpg",
        "description": "A fictional website on the topic of the \"Brasileirão\" 2019 Soccer Championship",
        "myRole": "Sole designer and developer from conceptualization to execution. The site fictionally explores the Brasileirão competition of 2019. Its back-end is handled by Node & Express, while its functionality is written in vanilla JS. The project presents fast and visually pleasant results.",
        "technologies": ["HTML", "CSS", "Bootstrap", "JavaScript", "jQuery", "Node.js", "Express"],
        "month": "June",
        "year": 2020,
        "url": "http://brasileirao.arielbehar.com/",
        "type": "MPA",
        "category": "real",
        "notes": []
    },
    {
        "_id": 4,
        "order": 3,
        "title": "Ariel Behar Portfolio",
        "image": "portfolio.jpg",
        "description": "My personal portfolio. Version 3.0",
        "myRole": "Although my original site was created in 2017, this version has undergone a thorough make-over with React. I've also made use of Typescript, which has contributed to the creation of an easily manageable codebase. All related assets have also been optimized, which has has resulted in a more pleasant UX and boosted overall performance.",
        "technologies": ["React", "TypeScript", "CSS", "Material UI", "Node.js", "Express"],
        "month": "February",
        "year": 2023,
        "url": "http://www.arielbehar.com",
        "type": "Bootstrap",
        "category": "real",
        "notes": [{ "note": "The site you are currently visiting" }  ]
    },
    {
        "_id": 5,
        "order": 4,
        "title": "A&M GameHub",
        "image": "am-gamehub.jpg",
        "description": "A desktop based web application to assist my little sisters learn English, European geography and Hebrew.",
        "myRole": "I am the sole designer and developer of this project from conceptualization to execution. The functionality of the application is written in vanilla JavaScript with the exception of a few lines of jQuery. Overall, a very exciting project with gratifying results.",
        "technologies": ["HTML", "CSS", "Bootstrap", "JavaScript", "jQuery"],
        "month": "Jan",
        "year": 2018,
        "url": "http://www.am-gamehub.arielbehar.com/",
        "type": "SPA",
        "category": "real",
        "notes": [ { "note": "The site's language is Bulgarian." }, { "note": "Optimized for large screen sizes only." }]
    },
    {
        "_id": 6,
        "order": 5,
        "title": "eSports Marketing Group",
        "image": "esports.jpg",
        "description": "Online marketing firm for eSports competitors. The site is a hub for people to receive representation, guorderance and marketing tools on a professional level.",
        "myRole": "Lead developer from conceptualization to execution. It was the first site I ever built with Wordpress and served me as an introduction to the CMS platform. It was an interesting concept to work on and I am very happy with the final result.",
        "technologies": ["Wordpress", "HTML", "CSS"],
        "month": "Aug",
        "year": 2017,
        "url": "http://esportmarketinggroup.com/",
        "type": "Wordpress",
        "category": "real",
        "notes": []
    },
    {
        "_id": 7,
        "order": 6,
        "title": "VX Aviation",
        "image": "vx-aviation.jpg",
        "description": "Company site for a Tampa Bay area based personal flight training school aiming for new student recruitement.",
        "myRole": "Sole designer and developer from conceptualization to execution. The development of this project was rather fast and enjoyable because of how comfortable I was feeling working with the Bootstrap framework at this point.",
        "technologies": ["HTML", "CSS", "SASS", "Bootstrap", "JavaScript", "jQuery", "PHP"],
        "month": "Aug",
        "year": 2017,
        "url": "http://vxaviation.arielbehar.com/",
        "type": "Bootstrap",
        "category": "real",
        "notes": []
    },
    {
        "_id": 8,
        "order": 7,
        "title": "Blago-darya",
        "image": "blago-darya.jpg",
        "description": "Voluntary initiative to help shelter homeless and wounded animals in Bulgaria. The organization gathers funds through direct donations and product sales.",
        "myRole": "Sole designer and developer. This is my biggest and most gratifying project to date. It is for a great cause and is being led by a passionate friend which will expand this initiative to become the leading one of its kind in the country.",
        "technologies": ["Wordpress", "HTML", "CSS", "JavaScript", "jQuery"],
        "month": "Sept",
        "year": 2017,
        "url": "http://my-dummy-site.com/",
        "type": "Wordpress",
        "category": "real",
        "notes": [ { "note": "The site's language is Bulgarian." } ]
    },
    {
        "_id": 9,
        "order": 8,
        "title": "Travel@Style",
        "image": "travel.jpg",
        "description": "eCommerce platform for a New York based store focusing on travel apparel and hand-held steamer irons.",
        "myRole": "Sole designer and developer from conceptualization to execution. T@S is my first more complex extracurricular Bootstrap/JavaScript project. It took 2 months of sporadic work to finish it, but it was all worth it because it has all the functionalities it was intended to have.",
        "technologies": ["HTML", "CSS", "Bootstrap", "JavaScript", "jQuery", "PHP"],
        "month": "Aug",
        "year": 2017,
        "url": "http://travelatstyle.biz/",
        "type": "Bootstrap",
        "category": "real",
        "notes": []
    },
    {
        "_id": 10,
        "order": 9,
        "title": "T&T Customs",
        "image": "tt.jpg",
        "description": "The site is a front for a business creating custom apparel for school sports teams in the Tampa Bay area.",
        "myRole": "Lead developer from conceptualization to execution. The site went through several modifications during the development process since new and better creative tools were being provordered which were then implemented. The final result was rather pleasing.",
        "technologies": ["Wordpress", "HTML", "CSS"],
        "month": "July",
        "year": 2017,
        "url": "http://thomasandthomascustoms.com/",
        "type": "Wordpress",
        "category": "real",
        "notes": []
    },
    {
        "_id": 11,
        "order": 10,
        "title": "The Credit Score Guru",
        "image": "guru.jpg",
        "description": "Credit repair site aiming to present viable options for people to fix their credit score and create positive purchasing habits in the future.",
        "myRole": "Lead developer from conceptualization to execution. This site was a rather enjoyable project for me to work on because of the relative experience I had already gained working with Wordpress.",
        "technologies": ["Wordpress", "HTML", "CSS"],
        "month": "July",
        "year": 2017,
        "url": "http://thecreditscore.guru/",
        "type": "Wordpress",
        "category": "real",
        "notes": []
    },
    {
        "_id": 12,
        "order": 11,
        "title": "HUG Tampa Bay",
        "image": "hug.jpg",
        "description": "A Tampa based non-profit organization that strives to connect people with disabilities to social activities and events in the community",
        "myRole": "I worked on this project in the capacity of web designer for Visual Edge Design. I was tasked to redesign it while being provordered with clear instructions what the final outcome should be. Additionally, I incorporated different functionalities and improved on the overall look and feel while sticking to the original character of the site.",
        "technologies": ["Wordpress", "HTML", "CSS", "JavaScript", "jQuery"],
        "month": "Oct",
        "year": 2017,
        "url": "http://helpusgather.org/",
        "type": "Wordpress",
        "category": "real",
        "notes": []
    },
    {
        "_id": 13,
        "order": 12,
        "title": "Body Wrap Spalon",
        "image": "ispalon.jpg",
        "description": "An Oklahoma based Spa Services website. The site appeals mainly to women, but offers treatments also for men.",
        "myRole": "Redesign and face-lift of the overall look and feel of the website. I worked on this project in the capacity of web designer for Visual Edge Design. I was tasked to bring this site up to date, by applying design concepts that conform to the 2017 tendencies, while also keeping the already established character of the brand.",
        "technologies": ["Wordpress", "HTML", "CSS", "JavaScript", "jQuery"],
        "month": "Nov",
        "year": 2017,
        "url": "http://www.bodywrapspalon.com/",
        "type": "Wordpress",
        "category": "real",
        "notes": []
    }
]